feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Prog/Libraries/iLLD/TC27D/Tricore/Eray/Std/IfxEray.h
/** \brief Received header in a frame.
 */
typedef struct
{
    uint16 frameId : 11;                     /**< \brief received frame id. */
    uint8  payloadLength : 7;                /**< \brief received payload length. */
    uint16 headerCrc : 11;                   /**< \brief received header crc. */
    uint8  nullFrameIndicator : 1;           /**< \brief 0 : no data frame received; 1: atleast one data frame received. */
    uint8  syncFrame : 1;                    /**< \brief 0 : received frame is not a synch frame ; 1 : receive frame is a synch frame. */
    uint8  startupFrame : 1;                 /**< \brief 0 : received frame is not a startup frame ; 1 : receive frame is a startup frame. */
    uint8  cycleNumber : 7;                  /**< \brief cycle number in which frame is received. */
    uint8  payloadPreambleIndicator : 1;     /**< \brief 1 : received payload segment has network management and message id or not; 0 : It hasn't. */
} IfxEray_ReceivedHeader;

/** \brief Transmit control structure.
 */
typedef struct
{
    boolean headerTransfered;        /**< \brief whether header is transfered from input buffers to Message RAM or not. */
    boolean dataTransfered;          /**< \brief whether data is transfered from input buffers to Message RAM or not. */
    boolean transferRequested;       /**< \brief transmit buffer released for transmission or not. */
    uint8   bufferIndex;             /**< \brief buffer index in the Message RAM. */
} IfxEray_SlotConfig;

/** \} */

/** \addtogroup IfxLld_Eray_Std_Interrupt
 * \{ */

/******************************************************************************/
/*-------------------------Inline Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Clears the error flag requested.
 * \param eray pointer to ERAY module registers.
 * \param errorFlag error flag to be cleared.
 * \return None
 */
IFX_INLINE void IfxEray_clearErrorFlag(Ifx_ERAY *eray, IfxEray_ClearErrorFlag errorFlag);

/** \brief Clears the status flag requested.
 * \param eray pointer to ERAY module registers.
 * \param statusFlag status flag to be cleared.
 * \return None
 */
IFX_INLINE void IfxEray_clearStatusFlag(Ifx_ERAY *eray, IfxEray_ClearStatusFlag statusFlag);

/** \brief Gets the error interrupt flags.
 * \param eray pointer to ERAY module registers.
 * \return error interrupt flags.
 */
IFX_INLINE Ifx_ERAY_EIR IfxEray_getErrorInterrupts(Ifx_ERAY *eray);

/** \brief Gets the IBUSY service request.
 * \param eray pointer to ERAY module registers.
 * \return address of IBUSY service request value.
 */
IFX_INLINE volatile Ifx_SRC_SRCR *IfxEray_getInputBufferBusySrcPtr(Ifx_ERAY *eray);

/** \brief Gets the INT0 service request.
 * \param eray pointer to ERAY module registers.
 * \return address of INT0 service request value.
 */
IFX_INLINE volatile Ifx_SRC_SRCR *IfxEray_getInterruptLine0SrcPtr(Ifx_ERAY *eray);

/** \brief Gets the INT1 service request.
 * \param eray pointer to ERAY module registers.
 * \return address of INT1 service request value.
 */
IFX_INLINE volatile Ifx_SRC_SRCR *IfxEray_getInterruptLine1SrcPtr(Ifx_ERAY *eray);

/** \brief Gets the message buffers interrupt status.
 * \param eray pointer to ERAY module registers.
 * \param messageBuffer message buffer to which interrupt status be checked.
 * \return message buffer interrupt status.
 */
IFX_INLINE boolean IfxEray_getMessageBufferInterruptStatus(Ifx_ERAY *eray, uint8 messageBuffer);

/** \brief Gets the MBSC0 service request.
 * \param eray pointer to ERAY module registers.
 * \return address of MBSC0 service request value.
 */
IFX_INLINE volatile Ifx_SRC_SRCR *IfxEray_getMessageBufferStatus0SrcPtr(Ifx_ERAY *eray);

/** \brief Gets the MBSC1 service request.
 * \param eray pointer to ERAY module registers.
 * \return address of MBSC1 service request value.
 */
IFX_INLINE volatile Ifx_SRC_SRCR *IfxEray_getMessageBufferStatus1SrcPtr(Ifx_ERAY *eray);

/** \brief Gets the NDAT0 service request.
 * \param eray pointer to ERAY module registers.
 * \return address of NDAT0 service request value.
 */
IFX_INLINE volatile Ifx_SRC_SRCR *IfxEray_getNewDataInterrupt0SrcPtr(Ifx_ERAY *eray);

/** \brief Gets the NDAT1 service request.
 * \param eray pointer to ERAY module registers.
 * \return address of NDAT1 service request value.
 */
IFX_INLINE volatile Ifx_SRC_SRCR *IfxEray_getNewDataInterrupt1SrcPtr(Ifx_ERAY *eray);

/** \brief Gets the new data interrupt buffers status.
 * \param eray pointer to ERAY module registers.
 * \param ndat message buffer number configured to which ndat occurs.
 * \return ndat interrupt buffer.
 */
IFX_INLINE boolean IfxEray_getNewDataInterruptStatus(Ifx_ERAY *eray, uint8 ndat);

/** \brief Gets the OBUSY service request.
 * \param eray pointer to ERAY module registers.
 * \return address of OBUSY service request value.
 */
IFX_INLINE volatile Ifx_SRC_SRCR *IfxEray_getOutputBufferBusySrcPtr(Ifx_ERAY *eray);

/** \brief Gets the status interrupt flags.
 * \param eray pointer to ERAY module registers.
 * \return status interrupt flags.
 */
IFX_INLINE Ifx_ERAY_SIR IfxEray_getStatusInterrupts(Ifx_ERAY *eray);

/** \brief Gets the TINT0 service request.
 * \param eray pointer to ERAY module registers.
 * \return address of TINT0 service request value.
 */
IFX_INLINE volatile Ifx_SRC_SRCR *IfxEray_getTimerInterrupt0SrcPtr(Ifx_ERAY *eray);

/** \brief Gets the TINT1 service request.
 * \param eray pointer to ERAY module registers.
 * \return address of TINT1 service request value.
 */
IFX_INLINE volatile Ifx_SRC_SRCR *IfxEray_getTimerInterrupt1SrcPtr(Ifx_ERAY *eray);

/******************************************************************************/
/*-------------------------Global Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Clears all the error flags.
 * \param eray pointer to ERAY module registers.
 * \return None
 */
IFX_EXTERN void IfxEray_clearAllFlags(Ifx_ERAY *eray);

/** \brief Enables all the Interrupt lines.
 * \param eray pointer to ERAY module registers.
 * \return None
 */
IFX_EXTERN void IfxEray_enableInterruptLines(Ifx_ERAY *eray);

/** \brief Selects between MBSC0 and MBSC1 interrupt destination
 * \param eray pointer to ERAY module registers.
 * \param messageBuffer message buffer interrupt which should be configured
 * \param messageBufferDestination selects MBSC0 or MBSC1 interrupt output
 * \return None
 */
IFX_EXTERN void IfxEray_setMessageBufferInterruptDestination(Ifx_ERAY *eray, uint8 messageBuffer, uint8 messageBufferDestination);

/** \brief Selects between NDAT0 and NDAT1 interrupt destination
 * \param eray pointer to ERAY module registers.
 * \param ndat NDAT interrupt which should be configured
 * \param ndatDestination selects NDAT0 or NDAT1 interrupt output
 * \return None
 */
IFX_EXTERN void IfxEray_setNewDataInterruptDestination(Ifx_ERAY *eray, uint8 ndat, uint8 ndatDestination);

