feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Prog/Libraries/iLLD/TC27D/Tricore/Eray/Std/IfxEray.h
/** \} */

/** \addtogroup IfxLld_Eray_Std_IO
 * \{ */

/******************************************************************************/
/*-------------------------Inline Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Initialises a RX pin.
 * \param rx the RX Pin which should be configured.
 * \param rxMode the pin input mode which should be configured.
 * \return None
 */
IFX_INLINE void IfxEray_initRxPin(const IfxEray_Rxd_In *rx, IfxPort_InputMode rxMode);

/** \brief Initializes a TX Enable output.
 * \param txEn the TX Enable Pin which should be configured.
 * \param txEnMode the pin output mode which should be configured.
 * \param padDriver the pad driver mode which should be configured.
 * \return None
 */
IFX_INLINE void IfxEray_initTxEnPin(const IfxEray_Txen_Out *txEn, IfxPort_OutputMode txEnMode, IfxPort_PadDriver padDriver);

/** \brief Initializes a TX output.
 * \param tx the TX Pin which should be configured.
 * \param txMode the pin output mode which should be configured.
 * \param padDriver the pad driver mode which should be configured.
 * \return None
 */
IFX_INLINE void IfxEray_initTxPin(const IfxEray_Txd_Out *tx, IfxPort_OutputMode txMode, IfxPort_PadDriver padDriver);

/** \} */

/** \addtogroup IfxLld_Eray_Std_Module
 * \{ */

/******************************************************************************/
/*-------------------------Inline Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Disables the ERAY module.
 * \param eray pointer to ERAY module registers.
 * \return None
 */
IFX_INLINE void IfxEray_disableModule(Ifx_ERAY *eray);

/** \brief Enables the ERAY module.
 * \param eray pointer to ERAY module registers.
 * \return None
 */
IFX_INLINE void IfxEray_enableModule(Ifx_ERAY *eray);

/** \brief Returns the module's suspend state.
 * TRUE :if module is suspended.
 * FALSE:if module is not yet suspended.
 * \param eray Pointer to ERAY module registers
 * \return Suspend status (TRUE / FALSE)
 */
IFX_INLINE boolean IfxEray_isModuleSuspended(Ifx_ERAY *eray);

/** \brief Sets the sensitivity of the module to sleep signal
 * \param eray pointer to ERAY registers
 * \param mode mode selection (enable/disable)
 * \return None
 */
IFX_INLINE void IfxEray_setSleepMode(Ifx_ERAY *eray, IfxEray_SleepMode mode);

/******************************************************************************/
/*-------------------------Global Function Prototypes-------------------------*/
/******************************************************************************/

/**
 * \param eray Resource index of the ERAY
 * \return ERAY module register address
 */
IFX_EXTERN Ifx_ERAY *IfxEray_getAddress(IfxEray_Index eray);

/** \brief API to get the resource index of the ERAY specified.
 * \param eray Pointer to the ERAY HW module (register memory map)
 * \return Resource index of the ERAY
 */
IFX_EXTERN IfxEray_Index IfxEray_getIndex(Ifx_ERAY *eray);

/** \brief Resets the ERAY kernel.
 * \param eray pointer to ERAY module registers.
 * \return None
 */
IFX_EXTERN void IfxEray_resetModule(Ifx_ERAY *eray);

/** \} */

/** \addtogroup IfxLld_Eray_Std_Status
 * \{ */

/******************************************************************************/
/*-------------------------Inline Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Gets the FIFO status.
 * \param eray pointer to ERAY module registers.
 * \return FIFO status.
 */
IFX_INLINE Ifx_ERAY_FSR IfxEray_getFifoStatus(Ifx_ERAY *eray);

/** \brief Gets the Input Buffer Host Busy status.
 * \param eray pointer to ERAY module registers.
 * \return TRUE if Host is Busy otherwise FALSE.
 */
IFX_INLINE boolean IfxEray_getInputBufferBusyHostStatus(Ifx_ERAY *eray);

/** \brief Gets the Input Buffer Shadow status.
 * \param eray pointer to ERAY module registers.
 * \return TRUE if busy otherwise FALSE
 */
IFX_INLINE uint8 IfxEray_getInputBufferBusyShadowStatus(Ifx_ERAY *eray);

/** \brief Gets the output buffer index.
 * \param eray pointer to ERAY module registers.
 * \return output buffer index.
 */
IFX_INLINE uint8 IfxEray_getOutputBuffer(Ifx_ERAY *eray);

/** \brief Gets the Output Buffer Shadow status.
 * \param eray pointer to ERAY module registers.
 * \return TRUE if busy otherwise FALSE
 */
IFX_INLINE boolean IfxEray_getOutputBufferBusyShadowStatus(Ifx_ERAY *eray);

/** \brief Gets the current POC state.
 * \param eray pointer to ERAY module registers.
 * \return current POC state.
 */
IFX_INLINE IfxEray_PocState IfxEray_getPocState(Ifx_ERAY *eray);

/** \brief Gets the received wakeup pattern channel.
 * \param eray pointer to ERAY module registers.
 * \return received wakeup pattern channel.
 */
IFX_INLINE IfxEray_WakeupChannel IfxEray_getWakeupPatternReceivedChannel(Ifx_ERAY *eray);

/** \brief Waits until the controller enters required POC state.
 * \param eray pointer to ERAY module registers.
 * \param pocState POC state upto which controller waits.
 * \return None
 */
IFX_INLINE void IfxEray_waitForPocState(Ifx_ERAY *eray, IfxEray_PocState pocState);

/******************************************************************************/
/*-------------------------Global Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Changes the Commmunication Controller state.
 * \param eray pointer to ERAY module registers.
 * \param pocCommand POC command which triggers the Controller state.
 * \return TRUE if command accepted otherwise FALSE.
 */
IFX_EXTERN boolean IfxEray_changePocState(Ifx_ERAY *eray, IfxEray_PocCommand pocCommand);

/** \brief Sets the POC state to Ready state.
 * \param eray pointer to ERAY module registers.
 * \return None
 */
IFX_EXTERN void IfxEray_setPocReady(Ifx_ERAY *eray);

