feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Prog/Libraries/iLLD/TC27D/Tricore/Eray/Std/IfxEray.h
/** \} */

/** \addtogroup IfxLld_Eray_Std_Configuration
 * \{ */

/******************************************************************************/
/*-------------------------Inline Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief request to receive header section from message buffer.
 * \param eray pointer to ERAY module registers.
 * \param headerReceived whether header is received or not.
 * \return None
 */
IFX_INLINE void IfxEray_receiveHeader(Ifx_ERAY *eray, boolean headerReceived);

/** \brief sets the bit to send header in  frame.
 * \param eray pointer to ERAY module registers.
 * \param headerTransfered whether header transfered or not.
 * \return None
 */
IFX_INLINE void IfxEray_sendHeader(Ifx_ERAY *eray, boolean headerTransfered);

/** \brief Sets number of cycle pairs for Active state.
 * \param eray pointer to ERAY module registers.
 * \param numberOfCyclePairsForActive number of cycle pairs for Active state.
 * \return None
 */
IFX_INLINE void IfxEray_setActiveCyclePairs(Ifx_ERAY *eray, uint8 numberOfCyclePairsForActive);

/** \brief Sets auto delays between input, output buffers and message RAM
 * \param eray pointer to ERAY module registers.
 * \return None
 */
IFX_INLINE void IfxEray_setAutoDelayBuffers(Ifx_ERAY *eray);

/** \brief Sets baudrate on Flexray bus.
 * \param eray pointer to ERAY module registers.
 * \param baudrate baudrate on flexray bus.
 * \return None
 */
IFX_INLINE void IfxEray_setBaudrate(Ifx_ERAY *eray, IfxEray_Baudrate baudrate);

/** \brief Sets secured buffers in message RAM.
 * \param eray pointer to ERAY module registers.
 * \param secureValue secure value.
 * \return None
 */
IFX_INLINE void IfxEray_setBufferReconfigSecure(Ifx_ERAY *eray, uint8 secureValue);

/** \brief Sets channel A initial offstes.
 * \param eray pointer to ERAY module registers.
 * \param channelAMicrotickInitialOffset difference between reference points on channel A in microticks.
 * \param channelAMacrotickInitialOffset difference between reference points on channel A in macroticks.
 * \return None
 */
IFX_INLINE void IfxEray_setChannelAInitialOffsets(Ifx_ERAY *eray, uint8 channelAMicrotickInitialOffset, uint8 channelAMacrotickInitialOffset);

/** \brief Sets channel B initial offstes.
 * \param eray pointer to ERAY module registers.
 * \param channelBMicrotickInitialOffset difference between reference points on channel B in microticks.
 * \param channelBMacrotickInitialOffset difference between reference points on channel B in macroticks.
 * \return None
 */
IFX_INLINE void IfxEray_setChannelBInitialOffsets(Ifx_ERAY *eray, uint8 channelBMicrotickInitialOffset, uint8 channelBMacrotickInitialOffset);

/** \brief Sets receive delays on channels.
 * \param eray pointer to ERAY module registers.
 * \param channelAReceptionDelay reception delay on channel A.
 * \param channelBReceptionDelay reception delay on channel B.
 * \return None
 */
IFX_INLINE void IfxEray_setChannelsReceiveDelay(Ifx_ERAY *eray, uint8 channelAReceptionDelay, uint8 channelBReceptionDelay);

/** \brief Sets clock correction cycles for Passive and Halt.
 * \param eray pointer to ERAY module registers.
 * \param clockCorrectionCyclesPassive maximum number of cycles missing clock correction leading for passive state.
 * \param clockCorrectionCyclesHalt maximum number of cycles missing clock correction leading for halt state.
 * \return None
 */
IFX_INLINE void IfxEray_setClockCorrectionCycles(Ifx_ERAY *eray, uint8 clockCorrectionCyclesPassive, uint8 clockCorrectionCyclesHalt);

/** \brief lead to halt state in clock synch error.
 * \param eray pointer to ERAY module registers.
 * \param clockSyncErrorHalt whether to enter halt in clock synch error or not.
 * \return None
 */
IFX_INLINE void IfxEray_setClockSynchErrorHalt(Ifx_ERAY *eray, boolean clockSyncErrorHalt);

/** \brief Sets cluster drift values.
 * \param eray pointer to ERAY module registers.
 * \param clusterDrift cluster drift damping value used in clock synchronization.
 * \param maxDriftOffset maximum drift offset between two nodes.
 * \return None
 */
IFX_INLINE void IfxEray_setClusterDriftValues(Ifx_ERAY *eray, uint8 clusterDrift, uint16 maxDriftOffset);

/** \brief Sets cluster startup deviation.
 * \param eray pointer to ERAY module registers.
 * \param acceptedStartupDeviation deviation for startup Frames during integration.
 * \return None
 */
IFX_INLINE void IfxEray_setClusterStartupDeviation(Ifx_ERAY *eray, uint16 acceptedStartupDeviation);

/** \brief Sets CAS symbol window duration.
 * \param eray pointer to ERAY module registers.
 * \param collisionAvoidanceDuration accepted duration of CAS symbol.
 * \return None
 */
IFX_INLINE void IfxEray_setCollisionAvoidanceDuration(Ifx_ERAY *eray, uint8 collisionAvoidanceDuration);

/** \brief sets duration of the communication cycle in Macroticks.
 * \param eray pointer to ERAY module registers.
 * \param macroticks duration of the communication cycle in Macroticks.
 * \return None
 */
IFX_INLINE void IfxEray_setCycleDurationMacroticks(Ifx_ERAY *eray, uint16 macroticks);

/** \brief sets duration of the communication cycle in Microticks.
 * \param eray pointer to ERAY module registers.
 * \param microticks duration of the communication cycle in Microticks.
 * \return None
 */
IFX_INLINE void IfxEray_setCycleDurationMicroticks(Ifx_ERAY *eray, uint32 microticks);

/** \brief Sets decoding correction value.
 * \param eray pointer to ERAY module registers.
 * \param decodingCorrection decoding correction value.
 * \return None
 */
IFX_INLINE void IfxEray_setDecodingCorrectionValue(Ifx_ERAY *eray, uint8 decodingCorrection);

/** \brief Sets dynamic slots count and length.
 * \param eray pointer to ERAY module registers.
 * \param dynamicSlotLength duration of dynamic slot in macroticks.
 * \param dynamicSlotCount number of dynamic slots in a communication cycle.
 * \param idleDynamicSlots duration of dynamic slot idle phase.
 * \return None
 */
IFX_INLINE void IfxEray_setDynamicSlots(Ifx_ERAY *eray, uint8 dynamicSlotLength, uint16 dynamicSlotCount, IfxEray_IdleDynamicSlots idleDynamicSlots);

/** \brief Sets external correction controls.
 * \param eray pointer to ERAY module registers.
 * \param externalOffset External offset correction control.
 * \param externalRate External rate correction control.
 * \return None
 */
IFX_INLINE void IfxEray_setExternalCorrectionControl(Ifx_ERAY *eray, IfxEray_ExternalOffset externalOffset, IfxEray_ExternalRate externalRate);

/** \brief Sets external correction values.
 * \param eray pointer to ERAY module registers.
 * \param externalOffsetCorrection external clock offset correction value.
 * \param externalRateCorrection external clock rate correction value.
 * \return None
 */
IFX_INLINE void IfxEray_setExternalCorrectionValues(Ifx_ERAY *eray, IfxEray_ExternalOffsetCorrection externalOffsetCorrection, IfxEray_ExternalRateCorrection externalRateCorrection);

/** \brief Sets FIFO buffer start idex.
 * \param eray pointer to ERAY module registers.
 * \param fifoBufferStartIndex FIFO buffer start idex.
 * \return None
 */
IFX_INLINE void IfxEray_setFifoBufferStartIndex(Ifx_ERAY *eray, uint8 fifoBufferStartIndex);

