feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Prog/Libraries/iLLD/TC27D/Tricore/Eray/Std/IfxEray.h
/** \brief Sets channels which transmits symbols.
 * \param eray pointer to ERAY module registers.
 * \param channelASymbolTransmitted whether symbol is transmitted in Channel A or not.
 * \param channelBSymbolTransmitted whether symbol is transmitted in Channel B or not.
 * \return None
 */
IFX_INLINE void IfxEray_setSymbolChannels(Ifx_ERAY *eray, boolean channelASymbolTransmitted, boolean channelBSymbolTransmitted);

/** \brief Sets the transmit slot mode.
 * \param eray pointer to ERAY module registers.
 * \param transmissionSlotMode transmission slot mode.
 * \return None
 */
IFX_INLINE void IfxEray_setTransmissionSlotMode(Ifx_ERAY *eray, IfxEray_TransmissionSlotMode transmissionSlotMode);

/** \brief Sets transmission start time duration.
 * \param eray pointer to ERAY module registers.
 * \param transmissionStartTime transmission start time.
 * \return None
 */
IFX_INLINE void IfxEray_setTransmissionStartTime(Ifx_ERAY *eray, uint8 transmissionStartTime);

/** \brief Sets transfer request to send frame.
 * \param eray pointer to ERAY module registers.
 * \param transferRequested whether transfer requested or not.
 * \return None
 */
IFX_INLINE void IfxEray_setTransmitRequest(Ifx_ERAY *eray, boolean transferRequested);

/** \brief Sets transmit wakeup times.
 * \param eray pointer to ERAY module registers.
 * \param transmitWakeupRepetitions transmission wakeup repetitions.
 * \param transmitWakeupIdleTime duration of transmit wakeup idle time.
 * \param transmitWakeupLowTime duration of transmit wakeup low time.
 * \return None
 */
IFX_INLINE void IfxEray_setTransmitWakeupTimes(Ifx_ERAY *eray, uint8 transmitWakeupRepetitions, uint8 transmitWakeupIdleTime, uint8 transmitWakeupLowTime);

/** \brief Configures transmitted frames for startup and synchronization.
 * \param eray pointer to ERAY module registers.
 * \param startupFrameTransmitted whether startup Frame transmitted or not.
 * \param synchFrameTransmitted whether synch Frame transmitted or not.
 * \return None
 */
IFX_INLINE void IfxEray_setTransmittedFrames(Ifx_ERAY *eray, boolean startupFrameTransmitted, boolean synchFrameTransmitted);

/** \brief Sets the transmit buffer number.
 * \param eray pointer to ERAY module registers.
 * \param bufferIndex buffer number in which frame is sent.
 * \return None
 */
IFX_INLINE void IfxEray_setTxBufferNumber(Ifx_ERAY *eray, uint8 bufferIndex);

/** \brief Swaps the shadow and Host output registers.
 * \param eray pointer to ERAY module registers.
 * \param swapRequested whether swap is requested or not.
 * \return None
 */
IFX_INLINE void IfxEray_setViewData(Ifx_ERAY *eray, boolean swapRequested);

/** \brief Sets the cluster wakeup channel.
 * \param eray pointer to ERAY module registers.
 * \param wakeupPatternChannel cluster wakeup pattern channel.
 * \return None
 */
IFX_INLINE void IfxEray_setWakeupPatternChannel(Ifx_ERAY *eray, IfxEray_WakeupChannel wakeupPatternChannel);

/** \} */

/** \addtogroup IfxLld_Eray_Std_Operative
 * \{ */

/******************************************************************************/
/*-------------------------Inline Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief requests to receive data from message buffer.
 * \param eray pointer to ERAY module registers.
 * \param dataReceived whether data to be received or not.
 * \return None
 */
IFX_INLINE void IfxEray_receiveData(Ifx_ERAY *eray, boolean dataReceived);

/** \brief sets the bit to send data in  frame.
 * \param eray pointer to ERAY module registers.
 * \param dataTransfered whether data transfered or not.
 * \return None
 */
IFX_INLINE void IfxEray_sendData(Ifx_ERAY *eray, boolean dataTransfered);

/******************************************************************************/
/*-------------------------Global Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Calculate and returns the CRC for frame.
 * \param payloadLength payload length configured for frame.
 * \param frameId slot id
 * \param startupFrameIndicator whether startup frame is indicated or not.
 * \param syncFrameIndicator whether sync frame is indicated or not.
 * \return calculated CRC value.
 */
IFX_EXTERN uint16 IfxEray_calcHeaderCrc(uint8 payloadLength, uint16 frameId, boolean startupFrameIndicator, boolean syncFrameIndicator);

/** \brief Reads the received data from output registers.
 * \param eray pointer to ERAY module registers.
 * \param data pointer to received data buffer.
 * \param payloadLength payload length received in a frame.
 * \return None
 */
IFX_EXTERN void IfxEray_readData(Ifx_ERAY *eray, uint32 *data, uint8 payloadLength);

/** \brief Reads header and data from output buffers.
 * \param eray pointer to ERAY module registers.
 * \param header header received in a frame.
 * \param data data received in a frame.
 * \param maxPayloadLength maximum payload length received in a frame.
 * \return None
 */
IFX_EXTERN void IfxEray_readFrame(Ifx_ERAY *eray, IfxEray_ReceivedHeader *header, uint32 *data, Ifx_SizeT maxPayloadLength);

/** \brief Writes header and data to Input buffers and set the slots.
 * \param eray pointer to ERAY module registers.
 * \param header Header section of message buffer.
 * \param data data section of message buffer.
 * \param slotConfig pointer slot allocation configuration structure.
 * \return None
 */
IFX_EXTERN void IfxEray_setSlot(Ifx_ERAY *eray, const IfxEray_Header *header, const uint32 *data, const IfxEray_SlotConfig *slotConfig);

/** \brief Writes data section of a frame to input data registers.
 * \param eray pointer to ERAY module registers.
 * \param data data segment in a frame.
 * \param payloadLength payload length configured for slot buffer.
 * \return None
 */
IFX_EXTERN void IfxEray_writeData(Ifx_ERAY *eray, const uint32 *data, uint8 payloadLength);

/** \} */

/******************************************************************************/
/*-------------------------Inline Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Gets the FIFO index.
 * \param eray pointer to ERAY module registers.
 * \return FIFO buffer index.
 */
IFX_INLINE uint8 IfxEray_getFifoIndex(Ifx_ERAY *eray);

/** \brief Configure the Module to Hard/Soft suspend mode.
 * Note: The api works only when the OCDS is enabled and in Supervisor Mode. When OCDS is disabled the OCS suspend control is ineffective.
 * \param eray Pointer to ERAY module registers
 * \param mode Module suspend mode
 * \return None
 */
IFX_INLINE void IfxEray_setSuspendMode(Ifx_ERAY *eray, IfxEray_SuspendMode mode);

/** \brief Provides functionality for both setting of pin direction as input and configuring pad driver.
 * \param rx the RX Pin which should be configured.
 * \param rxMode the pin input mode which should be configured.
 * \param padDriver Pad Driver Configuration
 * \return None
 */
IFX_INLINE void IfxEray_initRxPinWithPadLevel(const IfxEray_Rxd_In *rx, IfxPort_InputMode rxMode, IfxPort_PadDriver padDriver);

/******************************************************************************/
/*---------------------Inline Function Implementations------------------------*/
/******************************************************************************/

IFX_INLINE void IfxEray_clearErrorFlag(Ifx_ERAY *eray, IfxEray_ClearErrorFlag errorFlag)
{
    eray->EIR.U = errorFlag;
}


IFX_INLINE void IfxEray_clearStatusFlag(Ifx_ERAY *eray, IfxEray_ClearStatusFlag statusFlag)
{
    eray->SIR.U = statusFlag;
}


